Revit 2027 API
LoadComponent.LoadCaseOrCombinationId Property
 Load case or combination id.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId LoadCaseOrCombinationId { get; set; }
Public Property LoadCaseOrCombinationId As ElementId
	Get
	Set
public:
property ElementId^ LoadCaseOrCombinationId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member LoadCaseOrCombinationId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
LoadComponent Class
Autodesk.Revit.DB.Structure Namespace